'''
    Модуль 2
    Реализуйте все функции, затем запустите test.py для тестирования
    Встроенные функции min/max/sort использоавть нельзя (но можно написать свои)
'''

# Дан массив чисел и целое число. Если число - цифра (от 0 до 9), вернуть массив, состоящий из чисел исходного массива,
# оканчивающихся на эту цифру

def task_1(arr: list[int], n:int) -> list[int]:
    return []

# Дан массив чисел. Найти в нем минимум и максимум и вернуть массив, состоящий из чисел исходного массива,
# стоящих между ними (включая их самих). Считать, что в массиве есть как минимум 2 различных числа

def task_2(arr: list[int]) -> list[int]:
    return []

# Дан массив чисел. Вернуть два самых больших числа. Считать, что в массиве как минимум 2 числа
def task_3(arr: list[int]) -> list[int]:
    return []

# Дано 2 массива. Вернуть массив, состоящий из элементов первого массива (в их исходном порядке), которые есть во втором
def task_4(arr1: list[int], arr2: list[int]) -> list[int]:
    return []