'''
    Реализуйте все функции, затем запустите test.py для тестирования
'''
#1  Даны 3 целых числа. Если первое больше суммы двух других, вернуть второе, если нет, то минимальное
def task_1(a:int, b:int, c:int) -> int:
    return 0


#2   Даны 3 целых числа. Вывести минимальное, делящееся на 3. Если таких нет, вернуть максимальное из всех
def task_2(a:int, b:int, c:int) -> int:
    return 0


#3   Даны 3 целых числа. Если их сумма делится на 2 или на 5, то вернуть разность максимального и минимального, а если нет,
#    то сумму квадратов всех чисел
def task_3(a:int, b:int, c:int) -> int:
    return 0