'''
    Модуль 4
    Реализуйте все функции, затем запустите test.py для тестирования
    Здесь нельзя использовать встроенные функии для строк, кроме len()
'''


# Дана строка из латинских букв и пробелов. Посчитать "стоимость" букв в ней (a=A=1, b=B=2...)
def task_1(s: str) -> int:
    return 0


# Дана строка и символ. Вернуть массив, содержащий позиции всех вхождений симола в строке (("asddasa", 'a') -> [0, 4, 6])
def task_2(s: str, sym: str) -> list[int]:
    return []


# Даны 2 строки. Проверить, содержится ли вторая в первой
def task_3(s: str, sub: str) -> bool:
    return False


# Дана строка и массив символов-разделителей. Разделить по ним строку
def task_4(s: str, delims: list[str]) -> list[str]:
    return []
