'''
    Модуль 0
    Реализуйте все функции, затем запустите test.py для тестирования
    Встроенные функции min/max использоавть нельзя (но можно написать свои)
'''


# 1  Даны 2 целых числа. Если одно из них делится на другое, вернуть их сумму, иначе - произведение
# Ноль делится на любое число кроме нуля
def task_1(a: int, b: int) -> int:
    return 0


# 2  Дано целое число. Если оно делится на 3, вернуть 'fizz', если на 5 - 'buzz', если и на 3 и на 5 - 'fizzbuzz' иначе - пустую строку
def task_2(a: int) -> str:
    return ''


# 3 Даны длины двух катетов треугольника. Посчитать гипотенузу. Если хоть одно из чисел <= 0, вернуть -1
def task_3(a: float, b: float) -> float:
    return 0


# 4 Посчитать факториал числа. Если число < 0, вернуть -1
def task_4(a: int) -> int:
    return 0
