'''
    Модуль 1
    Реализуйте все функции, затем запустите test.py для тестирования
    Встроенные функции min/max использоавть нельзя (но можно написать свои)
'''


# 1  Даны 3 целых числа. Если первое больше суммы двух других, вернуть второе, если нет, то минимальное
def task_1(a: int, b: int, c: int) -> int:
    return 0


# 2   Даны 3 целых числа. Вывести минимальное, делящееся на 3. Если таких нет, вернуть максимальное из всех
def task_2(a: int, b: int, c: int) -> int:
    return 0


# 3   Даны 3 целых числа. Если их сумма делится на 2 или на 5, то вернуть разность максимального и минимального, а если нет,
#    то сумму квадратов всех чисел
def task_3(a: int, b: int, c: int) -> int:
    return 0


# 4   Даны 3 целых числа. Если третье больше первого более чем в 2 раза, вернуть сумму всех, если нет и второе меньше первого,
#    то разность квадратов второго и третьего, иначе - ноль
def task_4(a: int, b: int, c: int) -> int:
    return 0

# 5   Дан номер года. Вывести YES если он високосный, иначе - NO
#     https://ru.wikihow.com/%D0%B2%D1%8B%D1%81%D1%87%D0%B8%D1%82%D1%8B%D0%B2%D0%B0%D1%82%D1%8C-%D0%B2%D0%B8%D1%81%D0%BE%D0%BA%D0%BE%D1%81%D0%BD%D1%8B%D0%B5-%D0%B3%D0%BE%D0%B4%D1%8B
def task_5(year: int) -> str:
    return ''